zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SYSCON
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_SYSCON.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for SYSCON
 *
 * CMSIS Peripheral Access Layer for SYSCON
 */

#if !defined(PERI_SYSCON_H_)
#define PERI_SYSCON_H_                           /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SYSCON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON_Peripheral_Access_Layer SYSCON Peripheral Access Layer
 * @{
 */

/** SYSCON - Register Layout Typedef */
typedef struct {
  __IO uint32_t CPU1_CACHE_ISCR;                   /**< CPU1 Cache Interrupt Status and Control, offset: 0x0 */
  __I  uint32_t CPU1_CACHE_FADR;                   /**< Write Buffer Fault Address, offset: 0x4 */
  __I  uint32_t CPU1_CACHE_FATR;                   /**< Store Buffer Fault Attributes, offset: 0x8 */
  __I  uint32_t CPU1_CACHE_FDR;                    /**< Store Buffer Fault Data, offset: 0xC */
  __IO uint32_t CPU1_CACHE_CPCR2;                  /**< Core Platform Control 2, offset: 0x10 */
  __IO uint32_t CPU1_CACHE_LMDR;                   /**< CPU1_CACHE_LMDR, offset: 0x14 */
       uint8_t RESERVED_0[24];
  __IO uint32_t CPU1_WAIT;                         /**< CPU1 Wait, offset: 0x30 */
  __IO uint32_t CPU1_AHB_TIMEOUT;                  /**< CPU1 AHB Matrix TimeOut, offset: 0x34 */
  __IO uint32_t PKC_RAM_CG_CTRL;                   /**< PKC RAM clock control, offset: 0x38 */
  __IO uint32_t RAM_CG_CTRL;                       /**< System RAM clock control, offset: 0x3C */
  __IO uint32_t RAM_REMAP_CTRL;                    /**< System RAM Remap Control, offset: 0x40 */
       uint8_t RESERVED_1[4];
  __IO uint32_t SCG_LP_ENABLE;                     /**< System Clock Generator Low Power Enable, offset: 0x48 */
  __IO uint32_t ZENV_CTRL;                         /**< ZENV CORE Initial Vector Set, offset: 0x4C */
  __IO uint32_t ZENV_RESET_CTRL;                   /**< ZENV CORE Reset Controller, offset: 0x50 */
  __I  uint32_t JTAG_ID;                           /**< JTAG Chip ID, offset: 0x54 */
  __I  uint32_t DEVICE_TYPE;                       /**< Device Type, offset: 0x58 */
  __I  uint32_t DEVICE_ID;                         /**< Device ID, offset: 0x5C */
  __I  uint32_t DIEID;                             /**< Chip Revision ID and Number, offset: 0x60 */
       uint8_t RESERVED_2[4];
  __IO uint32_t SWD_ID;                            /**< Serial Wire Debug ID, offset: 0x68 */
  __I  uint32_t OEM_TYPE;                          /**< OEM Type, offset: 0x6C */
  __IO uint32_t PWM_SUBCTL;                        /**< PWM Sub-system Control, offset: 0x70 */
  __IO uint32_t FMC1_CTRL;                         /**< Control for Flash Memory Controller 1, offset: 0x74 */
  __IO uint32_t DMA_RF_WAKE_MAIN_0;                /**< DMA request 0-31 to wake up main domain, offset: 0x78 */
  __IO uint32_t DMA_RF_WAKE_MAIN_1;                /**< DMA request 32-63 to wake up main domain, offset: 0x7C */
  __IO uint32_t CAN_20MHZ_CLOCK_CTRL;              /**< Flexcan 20MHZ Clock Control, offset: 0x80 */
  __IO uint32_t SRAM0_ECC_CONTROL;                 /**< SRAM0 ECC Function Control, offset: 0x84 */
  __IO uint32_t SRAM0_ECC_REPORT;                  /**< SRAM0 ECC Error Report Control, offset: 0x88 */
  __IO uint32_t SRAM0_ECC_EVENT_RECORD;            /**< SRAM0 ECC Error Event Record, offset: 0x8C */
  __I  uint32_t SRAM0_ECC_FAULT_ADDR;              /**< SRAM0 Fault Address Register, offset: 0x90 */
  __I  uint32_t SRAM0_ECC_FAULT_ATTR;              /**< SRAM0 Fault Attribute Register, offset: 0x94 */
  __I  uint32_t SRAM0_ECC_FAULT_DATA;              /**< SRAM0 ECC Fault Data Low Register, offset: 0x98 */
  __IO uint32_t MATRIX_MODE_CTRL;                  /**< Matrix Mode Control, offset: 0x9C */
       uint8_t RESERVED_3[96];
  __IO uint32_t FMC_CG_CTRL;                       /**< Clock Gating Ctrl of Flash Memory Control, offset: 0x100 */
  __IO uint32_t FMC0_CTRL;                         /**< Control for Flash Memory Controller 0, offset: 0x104 */
  __IO uint32_t CPU1_ACCESS_CTRL;                  /**< CPU1 Access Control, offset: 0x108 */
       uint8_t RESERVED_4[244];
  __IO uint32_t GENERAL_REG_0;                     /**< General Register 0, offset: 0x200 */
  __IO uint32_t GENERAL_REG_1;                     /**< General Register 1, offset: 0x204 */
  __IO uint32_t GENERAL_REG_2;                     /**< General Register 2, offset: 0x208 */
  __IO uint32_t GENERAL_REG_3;                     /**< General Register 3, offset: 0x20C */
       uint8_t RESERVED_5[3312];
  __IO uint32_t AUTHENTICATE;                      /**< Protect SYSCON registers from unintentional writes, offset: 0xF00 */
} SYSCON_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON_Register_Masks SYSCON Register Masks
 * @{
 */

/*! @name CPU1_CACHE_ISCR - CPU1 Cache Interrupt Status and Control */
/*! @{ */

#define SYSCON_CPU1_CACHE_ISCR_CWBER_MASK        (0x10U)
#define SYSCON_CPU1_CACHE_ISCR_CWBER_SHIFT       (4U)
/*! CWBER - Cache Write Buffer Error Status
 *  0b0..No error
 *  0b1..Error occurred
 */
#define SYSCON_CPU1_CACHE_ISCR_CWBER(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_ISCR_CWBER_SHIFT)) & SYSCON_CPU1_CACHE_ISCR_CWBER_MASK)

