zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
#define SYSCON_CPU1_CACHE_ISCR_CWBEE_MASK        (0x100000U)
#define SYSCON_CPU1_CACHE_ISCR_CWBEE_SHIFT       (20U)
/*! CWBEE - Cache Write Buffer Error Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCON_CPU1_CACHE_ISCR_CWBEE(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_ISCR_CWBEE_SHIFT)) & SYSCON_CPU1_CACHE_ISCR_CWBEE_MASK)
/*! @} */

/*! @name CPU1_CACHE_FADR - Write Buffer Fault Address */
/*! @{ */

#define SYSCON_CPU1_CACHE_FADR_ADDRESS_MASK      (0xFFFFFFFFU)
#define SYSCON_CPU1_CACHE_FADR_ADDRESS_SHIFT     (0U)
/*! ADDRESS - Write Buffer Fault Address */
#define SYSCON_CPU1_CACHE_FADR_ADDRESS(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FADR_ADDRESS_SHIFT)) & SYSCON_CPU1_CACHE_FADR_ADDRESS_MASK)
/*! @} */

/*! @name CPU1_CACHE_FATR - Store Buffer Fault Attributes */
/*! @{ */

#define SYSCON_CPU1_CACHE_FATR_BEDA_MASK         (0x1U)
#define SYSCON_CPU1_CACHE_FATR_BEDA_SHIFT        (0U)
/*! BEDA - Bus Error Data Access Type
 *  0b0..Instruction
 *  0b1..Data
 */
#define SYSCON_CPU1_CACHE_FATR_BEDA(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FATR_BEDA_SHIFT)) & SYSCON_CPU1_CACHE_FATR_BEDA_MASK)

#define SYSCON_CPU1_CACHE_FATR_BEMD_MASK         (0x2U)
#define SYSCON_CPU1_CACHE_FATR_BEMD_SHIFT        (1U)
/*! BEMD - Bus Error Privilege Level
 *  0b0..User mode
 *  0b1..Supervisor or privileged mode
 */
#define SYSCON_CPU1_CACHE_FATR_BEMD(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FATR_BEMD_SHIFT)) & SYSCON_CPU1_CACHE_FATR_BEMD_MASK)

#define SYSCON_CPU1_CACHE_FATR_BESZ_MASK         (0x30U)
#define SYSCON_CPU1_CACHE_FATR_BESZ_SHIFT        (4U)
/*! BESZ - Bus Error Size
 *  0b00..8-bit
 *  0b01..16-bit
 *  0b10..32-bit
 *  0b11..Reserved
 */
#define SYSCON_CPU1_CACHE_FATR_BESZ(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FATR_BESZ_SHIFT)) & SYSCON_CPU1_CACHE_FATR_BESZ_MASK)

#define SYSCON_CPU1_CACHE_FATR_BEWT_MASK         (0x80U)
#define SYSCON_CPU1_CACHE_FATR_BEWT_SHIFT        (7U)
/*! BEWT - Bus Error Write
 *  0b0..Read
 *  0b1..Write
 */
#define SYSCON_CPU1_CACHE_FATR_BEWT(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FATR_BEWT_SHIFT)) & SYSCON_CPU1_CACHE_FATR_BEWT_MASK)

#define SYSCON_CPU1_CACHE_FATR_BEMN_MASK         (0xF00U)
#define SYSCON_CPU1_CACHE_FATR_BEMN_SHIFT        (8U)
/*! BEMN - Bus Error Master Number */
#define SYSCON_CPU1_CACHE_FATR_BEMN(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FATR_BEMN_SHIFT)) & SYSCON_CPU1_CACHE_FATR_BEMN_MASK)

#define SYSCON_CPU1_CACHE_FATR_BEOVR_MASK        (0x80000000U)
#define SYSCON_CPU1_CACHE_FATR_BEOVR_SHIFT       (31U)
/*! BEOVR - Bus Error Overrun
 *  0b0..No overrun
 *  0b1..Overrun
 */
#define SYSCON_CPU1_CACHE_FATR_BEOVR(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FATR_BEOVR_SHIFT)) & SYSCON_CPU1_CACHE_FATR_BEOVR_MASK)
/*! @} */

/*! @name CPU1_CACHE_FDR - Store Buffer Fault Data */
/*! @{ */

#define SYSCON_CPU1_CACHE_FDR_BFD_MASK           (0xFFFFFFFFU)
#define SYSCON_CPU1_CACHE_FDR_BFD_SHIFT          (0U)
/*! BFD - Fault Data */
#define SYSCON_CPU1_CACHE_FDR_BFD(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_FDR_BFD_SHIFT)) & SYSCON_CPU1_CACHE_FDR_BFD_MASK)
/*! @} */

/*! @name CPU1_CACHE_CPCR2 - Core Platform Control 2 */
/*! @{ */

#define SYSCON_CPU1_CACHE_CPCR2_CCBC_MASK        (0x1U)
#define SYSCON_CPU1_CACHE_CPCR2_CCBC_SHIFT       (0U)
/*! CCBC - Clear Code Bus Cache
 *  0b0..No effect
 *  0b1..Clear code bus cache
 */
#define SYSCON_CPU1_CACHE_CPCR2_CCBC(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_CCBC_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_CCBC_MASK)

#define SYSCON_CPU1_CACHE_CPCR2_DCCWB_MASK       (0x2U)
#define SYSCON_CPU1_CACHE_CPCR2_DCCWB_SHIFT      (1U)
/*! DCCWB - Disable Code Cache Write Buffer
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCON_CPU1_CACHE_CPCR2_DCCWB(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_DCCWB_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_DCCWB_MASK)

#define SYSCON_CPU1_CACHE_CPCR2_FCCNA_MASK       (0x4U)
#define SYSCON_CPU1_CACHE_CPCR2_FCCNA_SHIFT      (2U)
/*! FCCNA - Force Code Cache to No Allocation
 *  0b0..Allocation
 *  0b1..No allocation
 */
#define SYSCON_CPU1_CACHE_CPCR2_FCCNA(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_FCCNA_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_FCCNA_MASK)

#define SYSCON_CPU1_CACHE_CPCR2_DCBC_MASK        (0x8U)
#define SYSCON_CPU1_CACHE_CPCR2_DCBC_SHIFT       (3U)
/*! DCBC - Disable Code Bus Cache
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCON_CPU1_CACHE_CPCR2_DCBC(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_DCBC_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_DCBC_MASK)

#define SYSCON_CPU1_CACHE_CPCR2_CBCS_MASK        (0xF0U)
#define SYSCON_CPU1_CACHE_CPCR2_CBCS_SHIFT       (4U)
/*! CBCS - Code Bus Cache Size
 *  0b0000..0 KB
 *  0b0001..1 KB
 *  0b0010..2 KB
 *  0b0011..4 KB
 *  0b0100..8 KB
 *  0b0101..16 KB
 *  0b0110..32 KB
 */
#define SYSCON_CPU1_CACHE_CPCR2_CBCS(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_CBCS_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_CBCS_MASK)

#define SYSCON_CPU1_CACHE_CPCR2_PCCMCTRL_MASK    (0x10000U)
#define SYSCON_CPU1_CACHE_CPCR2_PCCMCTRL_SHIFT   (16U)
/*! PCCMCTRL - Bypass Fixed Code Cache Map
 *  0b0..Do not bypass
 *  0b1..Bypass
 */
#define SYSCON_CPU1_CACHE_CPCR2_PCCMCTRL(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_PCCMCTRL_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_PCCMCTRL_MASK)

#define SYSCON_CPU1_CACHE_CPCR2_LCCPWB_MASK      (0x20000U)
#define SYSCON_CPU1_CACHE_CPCR2_LCCPWB_SHIFT     (17U)
/*! LCCPWB - Limit Code Cache Peripheral Write Buffering
 *  0b0..Do not limit
 *  0b1..Limit
 */
#define SYSCON_CPU1_CACHE_CPCR2_LCCPWB(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_CPCR2_LCCPWB_SHIFT)) & SYSCON_CPU1_CACHE_CPCR2_LCCPWB_MASK)
/*! @} */

/*! @name CPU1_CACHE_LMDR - CPU1_CACHE_LMDR */
/*! @{ */

#define SYSCON_CPU1_CACHE_LMDR_MT_MASK           (0xE000U)
#define SYSCON_CPU1_CACHE_LMDR_MT_SHIFT          (13U)
/*! MT - Memory Type
 *  0b000..SRAM_L
 *  0b001..SRAM_U
 *  0b010..PC Cache
 *  0b011..PS Cache
 */
#define SYSCON_CPU1_CACHE_LMDR_MT(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_MT_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_MT_MASK)

