zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
#define SYSCON_CPU1_CACHE_LMDR_RO_MASK           (0x10000U)
#define SYSCON_CPU1_CACHE_LMDR_RO_SHIFT          (16U)
/*! RO - Read-Only
 *  0b0..Writes allowed
 *  0b1..Writes ignored
 */
#define SYSCON_CPU1_CACHE_LMDR_RO(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_RO_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_RO_MASK)

#define SYSCON_CPU1_CACHE_LMDR_DPW_MASK          (0xE0000U)
#define SYSCON_CPU1_CACHE_LMDR_DPW_SHIFT         (17U)
/*! DPW - LMEM Data Path Width
 *  0b000..Reserved
 *  0b001..Reserved
 *  0b010..32 bits
 *  0b011..64 bits
 *  0b100..Reserved
 *  0b111..Reserved
 */
#define SYSCON_CPU1_CACHE_LMDR_DPW(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_DPW_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_DPW_MASK)

#define SYSCON_CPU1_CACHE_LMDR_WY_MASK           (0xF00000U)
#define SYSCON_CPU1_CACHE_LMDR_WY_SHIFT          (20U)
/*! WY - Level 1 Cache Ways
 *  0b0000..No cache
 *  0b0010..2-way set associative
 *  0b0100..4-way set associative
 *  0b1000..8-way set associative
 */
#define SYSCON_CPU1_CACHE_LMDR_WY(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_WY_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_WY_MASK)

#define SYSCON_CPU1_CACHE_LMDR_LMSZ_MASK         (0xF000000U)
#define SYSCON_CPU1_CACHE_LMDR_LMSZ_SHIFT        (24U)
/*! LMSZ - LMEM Size
 *  0b0000..No memory
 *  0b0001..1 KB
 *  0b0010..2 KB
 *  0b0011..4 KB
 *  0b0100..8 KB
 *  0b0101..16 KB
 *  0b0110..32 KB
 *  0b0111..64 KB
 *  0b1000..128 KB
 *  0b1001..256 KB
 *  0b1010..512 KB
 *  0b1011..1024 KB
 *  0b1100..2048 KB
 *  0b1101..4096 KB
 *  0b1110..8192 KB
 *  0b1111..16384 KB
 */
#define SYSCON_CPU1_CACHE_LMDR_LMSZ(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_LMSZ_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_LMSZ_MASK)

#define SYSCON_CPU1_CACHE_LMDR_LMSZH_MASK        (0x10000000U)
#define SYSCON_CPU1_CACHE_LMDR_LMSZH_SHIFT       (28U)
/*! LMSZH - LMEM Size Hole
 *  0b0..LMEM has a power-of-2 capacity
 *  0b1..LMEM has a capacity of 0.75 * LMSZ
 */
#define SYSCON_CPU1_CACHE_LMDR_LMSZH(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_LMSZH_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_LMSZH_MASK)

#define SYSCON_CPU1_CACHE_LMDR_V_MASK            (0x80000000U)
#define SYSCON_CPU1_CACHE_LMDR_V_SHIFT           (31U)
/*! V - Valid
 *  0b0..Not present
 *  0b1..Present
 */
#define SYSCON_CPU1_CACHE_LMDR_V(x)              (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_CACHE_LMDR_V_SHIFT)) & SYSCON_CPU1_CACHE_LMDR_V_MASK)
/*! @} */

/*! @name CPU1_WAIT - CPU1 Wait */
/*! @{ */

#define SYSCON_CPU1_WAIT_cpu1_wait_control_MASK  (0xFU)
#define SYSCON_CPU1_WAIT_cpu1_wait_control_SHIFT (0U)
/*! cpu1_wait_control - CPU1 Wait Control
 *  0b1010..Enable CPU1 Wait, any other value will disable CPU1 Wait
 */
#define SYSCON_CPU1_WAIT_cpu1_wait_control(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_WAIT_cpu1_wait_control_SHIFT)) & SYSCON_CPU1_WAIT_cpu1_wait_control_MASK)
/*! @} */

/*! @name CPU1_AHB_TIMEOUT - CPU1 AHB Matrix TimeOut */
/*! @{ */

#define SYSCON_CPU1_AHB_TIMEOUT_ahb_timeout_cycle_MASK (0x3U)
#define SYSCON_CPU1_AHB_TIMEOUT_ahb_timeout_cycle_SHIFT (0U)
/*! ahb_timeout_cycle - CPU1_AHB_TIMEOUT [2:0]: counter value; */
#define SYSCON_CPU1_AHB_TIMEOUT_ahb_timeout_cycle(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_AHB_TIMEOUT_ahb_timeout_cycle_SHIFT)) & SYSCON_CPU1_AHB_TIMEOUT_ahb_timeout_cycle_MASK)
/*! @} */

/*! @name PKC_RAM_CG_CTRL - PKC RAM clock control */
/*! @{ */

#define SYSCON_PKC_RAM_CG_CTRL_PKC_RAM_CG_AUTO_DIS_MASK (0x1U)
#define SYSCON_PKC_RAM_CG_CTRL_PKC_RAM_CG_AUTO_DIS_SHIFT (0U)
/*! PKC_RAM_CG_AUTO_DIS - PKC RAM clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_PKC_RAM_CG_CTRL_PKC_RAM_CG_AUTO_DIS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_PKC_RAM_CG_CTRL_PKC_RAM_CG_AUTO_DIS_SHIFT)) & SYSCON_PKC_RAM_CG_CTRL_PKC_RAM_CG_AUTO_DIS_MASK)
/*! @} */

/*! @name RAM_CG_CTRL - System RAM clock control */
/*! @{ */

#define SYSCON_RAM_CG_CTRL_RAM0_CG_AUTO_DIS_MASK (0x1U)
#define SYSCON_RAM_CG_CTRL_RAM0_CG_AUTO_DIS_SHIFT (0U)
/*! RAM0_CG_AUTO_DIS - RAM0 bank clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_RAM_CG_CTRL_RAM0_CG_AUTO_DIS(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_CG_CTRL_RAM0_CG_AUTO_DIS_SHIFT)) & SYSCON_RAM_CG_CTRL_RAM0_CG_AUTO_DIS_MASK)

#define SYSCON_RAM_CG_CTRL_RAM1_CG_AUTO_DIS_MASK (0x2U)
#define SYSCON_RAM_CG_CTRL_RAM1_CG_AUTO_DIS_SHIFT (1U)
/*! RAM1_CG_AUTO_DIS - RAM1 bank clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_RAM_CG_CTRL_RAM1_CG_AUTO_DIS(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_CG_CTRL_RAM1_CG_AUTO_DIS_SHIFT)) & SYSCON_RAM_CG_CTRL_RAM1_CG_AUTO_DIS_MASK)

#define SYSCON_RAM_CG_CTRL_RAM2_CG_AUTO_DIS_MASK (0x4U)
#define SYSCON_RAM_CG_CTRL_RAM2_CG_AUTO_DIS_SHIFT (2U)
/*! RAM2_CG_AUTO_DIS - RAM2 bank clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_RAM_CG_CTRL_RAM2_CG_AUTO_DIS(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_CG_CTRL_RAM2_CG_AUTO_DIS_SHIFT)) & SYSCON_RAM_CG_CTRL_RAM2_CG_AUTO_DIS_MASK)

#define SYSCON_RAM_CG_CTRL_RAM3_CG_AUTO_DIS_MASK (0x8U)
#define SYSCON_RAM_CG_CTRL_RAM3_CG_AUTO_DIS_SHIFT (3U)
/*! RAM3_CG_AUTO_DIS - RAM3 bank clock gating control
 *  0b0..Memory bank clock is gated automatically if no access more than 16 clock cycles
 *  0b1..Auto clock gating feature is disabled
 */
#define SYSCON_RAM_CG_CTRL_RAM3_CG_AUTO_DIS(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_CG_CTRL_RAM3_CG_AUTO_DIS_SHIFT)) & SYSCON_RAM_CG_CTRL_RAM3_CG_AUTO_DIS_MASK)
/*! @} */

/*! @name RAM_REMAP_CTRL - System RAM Remap Control */
/*! @{ */

#define SYSCON_RAM_REMAP_CTRL_REMAP_ENABLE_MASK  (0x1U)
#define SYSCON_RAM_REMAP_CTRL_REMAP_ENABLE_SHIFT (0U)
/*! REMAP_ENABLE - RAM Remap Enable
 *  0b0..Disable Remap
 *  0b1..Enable Remap
 */
#define SYSCON_RAM_REMAP_CTRL_REMAP_ENABLE(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_REMAP_CTRL_REMAP_ENABLE_SHIFT)) & SYSCON_RAM_REMAP_CTRL_REMAP_ENABLE_MASK)

