zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
#define SYSCON_RAM_REMAP_CTRL_LOCK_ENABLE_MASK   (0x80000000U)
#define SYSCON_RAM_REMAP_CTRL_LOCK_ENABLE_SHIFT  (31U)
/*! LOCK_ENABLE - Lock Bit
 *  0b0..Unlock, this register could be wrote
 *  0b1..Locked, theis register could not be wrote
 */
#define SYSCON_RAM_REMAP_CTRL_LOCK_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_RAM_REMAP_CTRL_LOCK_ENABLE_SHIFT)) & SYSCON_RAM_REMAP_CTRL_LOCK_ENABLE_MASK)
/*! @} */

/*! @name SCG_LP_ENABLE - System Clock Generator Low Power Enable */
/*! @{ */

#define SYSCON_SCG_LP_ENABLE_lp_mode_enable_MASK (0x80000000U)
#define SYSCON_SCG_LP_ENABLE_lp_mode_enable_SHIFT (31U)
/*! lp_mode_enable - scg low auto enter pwer enable
 *  0b0..disable
 *  0b1..enbale
 */
#define SYSCON_SCG_LP_ENABLE_lp_mode_enable(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_SCG_LP_ENABLE_lp_mode_enable_SHIFT)) & SYSCON_SCG_LP_ENABLE_lp_mode_enable_MASK)
/*! @} */

/*! @name ZENV_CTRL - ZENV CORE Initial Vector Set */
/*! @{ */

#define SYSCON_ZENV_CTRL_ZENV_INITVTOR_MASK      (0xFFFFFFFFU)
#define SYSCON_ZENV_CTRL_ZENV_INITVTOR_SHIFT     (0U)
/*! ZENV_INITVTOR - ZENV_CORE_INITVTOR */
#define SYSCON_ZENV_CTRL_ZENV_INITVTOR(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_ZENV_CTRL_ZENV_INITVTOR_SHIFT)) & SYSCON_ZENV_CTRL_ZENV_INITVTOR_MASK)
/*! @} */

/*! @name ZENV_RESET_CTRL - ZENV CORE Reset Controller */
/*! @{ */

#define SYSCON_ZENV_RESET_CTRL_ZENV_CORE_RESET_MASK (0xFU)
#define SYSCON_ZENV_RESET_CTRL_ZENV_CORE_RESET_SHIFT (0U)
/*! ZENV_CORE_RESET - ZENV_CORE_RESET
 *  0b1010..Reset ZENV CORE, any other value will release reset of ZENV CORE
 */
#define SYSCON_ZENV_RESET_CTRL_ZENV_CORE_RESET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_ZENV_RESET_CTRL_ZENV_CORE_RESET_SHIFT)) & SYSCON_ZENV_RESET_CTRL_ZENV_CORE_RESET_MASK)
/*! @} */

/*! @name JTAG_ID - JTAG Chip ID */
/*! @{ */

#define SYSCON_JTAG_ID_JTAG_ID_MASK              (0xFFFFFFFFU)
#define SYSCON_JTAG_ID_JTAG_ID_SHIFT             (0U)
/*! JTAG_ID - Indicates the device ID */
#define SYSCON_JTAG_ID_JTAG_ID(x)                (((uint32_t)(((uint32_t)(x)) << SYSCON_JTAG_ID_JTAG_ID_SHIFT)) & SYSCON_JTAG_ID_JTAG_ID_MASK)
/*! @} */

/*! @name DEVICE_TYPE - Device Type */
/*! @{ */

#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_NUM_MASK  (0xFFFFU)
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_NUM_SHIFT (0U)
/*! DEVICE_TYPE_NUM - Indicates the device part number */
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_NUM(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_DEVICE_TYPE_DEVICE_TYPE_NUM_SHIFT)) & SYSCON_DEVICE_TYPE_DEVICE_TYPE_NUM_MASK)

#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_SEC_MASK  (0x10000U)
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_SEC_SHIFT (16U)
/*! DEVICE_TYPE_SEC - Indicates the device type
 *  0b0..Non Secure
 *  0b1..Secure
 */
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_SEC(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_DEVICE_TYPE_DEVICE_TYPE_SEC_SHIFT)) & SYSCON_DEVICE_TYPE_DEVICE_TYPE_SEC_MASK)

#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_PKG_MASK  (0xF00000U)
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_PKG_SHIFT (20U)
/*! DEVICE_TYPE_PKG - Indicates the device package type
 *  0b0000..HLQFP
 *  0b0001..HTQFP
 *  0b0010..BGA
 *  0b0011..MAXQFP
 *  0b0100..QFN
 *  0b0101..CSP
 */
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_PKG(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_DEVICE_TYPE_DEVICE_TYPE_PKG_SHIFT)) & SYSCON_DEVICE_TYPE_DEVICE_TYPE_PKG_MASK)

#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_PIN_MASK  (0xFF000000U)
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_PIN_SHIFT (24U)
/*! DEVICE_TYPE_PIN - Indicates the device number of pins */
#define SYSCON_DEVICE_TYPE_DEVICE_TYPE_PIN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON_DEVICE_TYPE_DEVICE_TYPE_PIN_SHIFT)) & SYSCON_DEVICE_TYPE_DEVICE_TYPE_PIN_MASK)
/*! @} */

/*! @name DEVICE_ID - Device ID */
/*! @{ */

#define SYSCON_DEVICE_ID_DEVICE_ID_MASK          (0xFFFFFFFFU)
#define SYSCON_DEVICE_ID_DEVICE_ID_SHIFT         (0U)
/*! DEVICE_ID - Device ID */
#define SYSCON_DEVICE_ID_DEVICE_ID(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_DEVICE_ID_DEVICE_ID_SHIFT)) & SYSCON_DEVICE_ID_DEVICE_ID_MASK)
/*! @} */

/*! @name DIEID - Chip Revision ID and Number */
/*! @{ */

#define SYSCON_DIEID_MINOR_REVISION_MASK         (0xFU)
#define SYSCON_DIEID_MINOR_REVISION_SHIFT        (0U)
/*! MINOR_REVISION - Chip minor revision */
#define SYSCON_DIEID_MINOR_REVISION(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_DIEID_MINOR_REVISION_SHIFT)) & SYSCON_DIEID_MINOR_REVISION_MASK)

#define SYSCON_DIEID_MAJOR_REVISION_MASK         (0xF0U)
#define SYSCON_DIEID_MAJOR_REVISION_SHIFT        (4U)
/*! MAJOR_REVISION - Chip major revision */
#define SYSCON_DIEID_MAJOR_REVISION(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_DIEID_MAJOR_REVISION_SHIFT)) & SYSCON_DIEID_MAJOR_REVISION_MASK)

#define SYSCON_DIEID_MCO_NUM_IN_DIE_ID_MASK      (0xFFFFF00U)
#define SYSCON_DIEID_MCO_NUM_IN_DIE_ID_SHIFT     (8U)
/*! MCO_NUM_IN_DIE_ID - Chip number */
#define SYSCON_DIEID_MCO_NUM_IN_DIE_ID(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_DIEID_MCO_NUM_IN_DIE_ID_SHIFT)) & SYSCON_DIEID_MCO_NUM_IN_DIE_ID_MASK)
/*! @} */

/*! @name SWD_ID - Serial Wire Debug ID */
/*! @{ */

#define SYSCON_SWD_ID_SWD_INSTANCE_ID_MASK       (0xFU)
#define SYSCON_SWD_ID_SWD_INSTANCE_ID_SHIFT      (0U)
/*! SWD_INSTANCE_ID - Serial Wire Debug ID */
#define SYSCON_SWD_ID_SWD_INSTANCE_ID(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_SWD_ID_SWD_INSTANCE_ID_SHIFT)) & SYSCON_SWD_ID_SWD_INSTANCE_ID_MASK)
/*! @} */

/*! @name OEM_TYPE - OEM Type */
/*! @{ */

#define SYSCON_OEM_TYPE_OEM_SECURE_TYPE_MASK     (0xFU)
#define SYSCON_OEM_TYPE_OEM_SECURE_TYPE_SHIFT    (0U)
/*! OEM_SECURE_TYPE - OEM Type when OEMO state
 *  0b0101..Untrusted OEM
 *  0b1010..Trusted OEM
 */
#define SYSCON_OEM_TYPE_OEM_SECURE_TYPE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_OEM_TYPE_OEM_SECURE_TYPE_SHIFT)) & SYSCON_OEM_TYPE_OEM_SECURE_TYPE_MASK)
/*! @} */

/*! @name PWM_SUBCTL - PWM Sub-system Control */
/*! @{ */

#define SYSCON_PWM_SUBCTL_CLK0_EN_MASK           (0x1U)
#define SYSCON_PWM_SUBCTL_CLK0_EN_SHIFT          (0U)
/*! CLK0_EN - Enables PWM0 SUB0 Clock
 *  0b0..Disable
 *  0b1..Clock0 Enable
 */
#define SYSCON_PWM_SUBCTL_CLK0_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_PWM_SUBCTL_CLK0_EN_SHIFT)) & SYSCON_PWM_SUBCTL_CLK0_EN_MASK)

