zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
#define SYSCON_PWM_SUBCTL_CLK1_EN_MASK           (0x2U)
#define SYSCON_PWM_SUBCTL_CLK1_EN_SHIFT          (1U)
/*! CLK1_EN - Enables PWM0 SUB1 Clockn
 *  0b0..Disable
 *  0b1..Clock1 Enable
 */
#define SYSCON_PWM_SUBCTL_CLK1_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_PWM_SUBCTL_CLK1_EN_SHIFT)) & SYSCON_PWM_SUBCTL_CLK1_EN_MASK)

#define SYSCON_PWM_SUBCTL_CLK2_EN_MASK           (0x4U)
#define SYSCON_PWM_SUBCTL_CLK2_EN_SHIFT          (2U)
/*! CLK2_EN - Enables PWM0 SUB2 Clockn
 *  0b0..Disable
 *  0b1..Clock2 Enable
 */
#define SYSCON_PWM_SUBCTL_CLK2_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_PWM_SUBCTL_CLK2_EN_SHIFT)) & SYSCON_PWM_SUBCTL_CLK2_EN_MASK)
/*! @} */

/*! @name FMC1_CTRL - Control for Flash Memory Controller 1 */
/*! @{ */

#define SYSCON_FMC1_CTRL_DNCBEI_MASK             (0x4U)
#define SYSCON_FMC1_CTRL_DNCBEI_SHIFT            (2U)
/*! DNCBEI - Disable non-correctable bus errors on flash instruction fetches
 *  0b0..Bus error for non-correctable error on instruction fetch from flash
 *  0b1..Disable bus error response for non-correctable error on instruction fetch from flash
 */
#define SYSCON_FMC1_CTRL_DNCBEI(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DNCBEI_SHIFT)) & SYSCON_FMC1_CTRL_DNCBEI_MASK)

#define SYSCON_FMC1_CTRL_DNCBED_MASK             (0x8U)
#define SYSCON_FMC1_CTRL_DNCBED_SHIFT            (3U)
/*! DNCBED - Disable non-correctable bus errors on flash data fetches
 *  0b0..Bus error for non-correctable error on data fetch from flash
 *  0b1..Disable bus error response for non-correctable error on data fetch from flash
 */
#define SYSCON_FMC1_CTRL_DNCBED(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DNCBED_SHIFT)) & SYSCON_FMC1_CTRL_DNCBED_MASK)

#define SYSCON_FMC1_CTRL_DDP_MASK                (0x10U)
#define SYSCON_FMC1_CTRL_DDP_SHIFT               (4U)
/*! DDP - Disable Data Prefetch
 *  0b0..Enable Data Prefetch
 *  0b1..Disable Data Prefetch
 */
#define SYSCON_FMC1_CTRL_DDP(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DDP_SHIFT)) & SYSCON_FMC1_CTRL_DDP_MASK)

#define SYSCON_FMC1_CTRL_DFS_MASK                (0x20U)
#define SYSCON_FMC1_CTRL_DFS_SHIFT               (5U)
/*! DFS - Disable Flash Speculate
 *  0b0..Enable Flash Speculate
 *  0b1..Disable Flash Speculate
 */
#define SYSCON_FMC1_CTRL_DFS(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DFS_SHIFT)) & SYSCON_FMC1_CTRL_DFS_MASK)

#define SYSCON_FMC1_CTRL_LKIFR1_MASK             (0x80U)
#define SYSCON_FMC1_CTRL_LKIFR1_SHIFT            (7U)
/*! LKIFR1 - Lock IFR1
 *  0b0..IFR1 space can be accessed.
 *  0b1..IFR1 space cannot be accessed. This bit is sticky. Once set, it is cleared with reset.
 */
#define SYSCON_FMC1_CTRL_LKIFR1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_LKIFR1_SHIFT)) & SYSCON_FMC1_CTRL_LKIFR1_MASK)

#define SYSCON_FMC1_CTRL_ECFC_MASK               (0x100U)
#define SYSCON_FMC1_CTRL_ECFC_SHIFT              (8U)
/*! ECFC - Execute clear the flash cache
 *  0b0..do not clear the flash cache
 *  0b1..clear the flash cache (negate all valid bits in the cache)
 */
#define SYSCON_FMC1_CTRL_ECFC(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_ECFC_SHIFT)) & SYSCON_FMC1_CTRL_ECFC_MASK)

#define SYSCON_FMC1_CTRL_DFDC_MASK               (0x200U)
#define SYSCON_FMC1_CTRL_DFDC_SHIFT              (9U)
/*! DFDC - Disable flash data caching
 *  0b0..enable flash data caching
 *  0b1..disable flash data caching
 */
#define SYSCON_FMC1_CTRL_DFDC(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DFDC_SHIFT)) & SYSCON_FMC1_CTRL_DFDC_MASK)

#define SYSCON_FMC1_CTRL_DFIC_MASK               (0x400U)
#define SYSCON_FMC1_CTRL_DFIC_SHIFT              (10U)
/*! DFIC - Disable flash instruction caching
 *  0b0..enable flash instruction caching
 *  0b1..disable flash instruction caching
 */
#define SYSCON_FMC1_CTRL_DFIC(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DFIC_SHIFT)) & SYSCON_FMC1_CTRL_DFIC_MASK)

#define SYSCON_FMC1_CTRL_DFC_MASK                (0x800U)
#define SYSCON_FMC1_CTRL_DFC_SHIFT               (11U)
/*! DFC - Disable Flash Cache
 *  0b0..the flash cache is enable
 *  0b1..the flash cache is diabled
 */
#define SYSCON_FMC1_CTRL_DFC(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_DFC_SHIFT)) & SYSCON_FMC1_CTRL_DFC_MASK)

#define SYSCON_FMC1_CTRL_PFLEXSTALL_MASK         (0x10000U)
#define SYSCON_FMC1_CTRL_PFLEXSTALL_SHIFT        (16U)
/*! PFLEXSTALL - Flash Stall Enable
 *  0b0..Flash stall is disabled when flash is busy.
 *  0b1..Flash stall is enabled when flash is busy.
 */
#define SYSCON_FMC1_CTRL_PFLEXSTALL(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_PFLEXSTALL_SHIFT)) & SYSCON_FMC1_CTRL_PFLEXSTALL_MASK)

#define SYSCON_FMC1_CTRL_RO_MASK                 (0x80000000U)
#define SYSCON_FMC1_CTRL_RO_SHIFT                (31U)
/*! RO - Read-Only
 *  0b0..Writes to the FMC1_CTRL are allowed
 *  0b1..Writes to the FMC1_CTRL are ignored
 */
#define SYSCON_FMC1_CTRL_RO(x)                   (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC1_CTRL_RO_SHIFT)) & SYSCON_FMC1_CTRL_RO_MASK)
/*! @} */

/*! @name DMA_RF_WAKE_MAIN_0 - DMA request 0-31 to wake up main domain */
/*! @{ */

#define SYSCON_DMA_RF_WAKE_MAIN_0_disbale_main_wake_reg0_MASK (0xFFFFFFFFU)
#define SYSCON_DMA_RF_WAKE_MAIN_0_disbale_main_wake_reg0_SHIFT (0U)
/*! disbale_main_wake_reg0 - Disable Wake Up Main by DMA request 0-31
 *  0b00000000000000000000000000000000..Keep wake up MAIN
 *  0b00000000000000000000000000000001..Not wake up MAIN
 */
#define SYSCON_DMA_RF_WAKE_MAIN_0_disbale_main_wake_reg0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_DMA_RF_WAKE_MAIN_0_disbale_main_wake_reg0_SHIFT)) & SYSCON_DMA_RF_WAKE_MAIN_0_disbale_main_wake_reg0_MASK)
/*! @} */

/*! @name DMA_RF_WAKE_MAIN_1 - DMA request 32-63 to wake up main domain */
/*! @{ */

#define SYSCON_DMA_RF_WAKE_MAIN_1_disbale_main_wake_reg1_MASK (0xFFFFFFFFU)
#define SYSCON_DMA_RF_WAKE_MAIN_1_disbale_main_wake_reg1_SHIFT (0U)
/*! disbale_main_wake_reg1 - Disable Wake Up Main by DMA request 32-63
 *  0b00000000000000000000000000000000..Keep wake up MAIN
 *  0b00000000000000000000000000000001..Not wake up MAIN
 */
#define SYSCON_DMA_RF_WAKE_MAIN_1_disbale_main_wake_reg1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_DMA_RF_WAKE_MAIN_1_disbale_main_wake_reg1_SHIFT)) & SYSCON_DMA_RF_WAKE_MAIN_1_disbale_main_wake_reg1_MASK)
/*! @} */

/*! @name CAN_20MHZ_CLOCK_CTRL - Flexcan 20MHZ Clock Control */
/*! @{ */

#define SYSCON_CAN_20MHZ_CLOCK_CTRL_CAN_20MHZ_EN_MASK (0xFU)
#define SYSCON_CAN_20MHZ_CLOCK_CTRL_CAN_20MHZ_EN_SHIFT (0U)
/*! CAN_20MHZ_EN - Enable 20mhz For FlexCAN
 *  0b0101..Disable 20mhz clock for CAN, any other value also disable it.
 *  0b1010..Enable 20mhz clock for CAN
 */
#define SYSCON_CAN_20MHZ_CLOCK_CTRL_CAN_20MHZ_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_CAN_20MHZ_CLOCK_CTRL_CAN_20MHZ_EN_SHIFT)) & SYSCON_CAN_20MHZ_CLOCK_CTRL_CAN_20MHZ_EN_MASK)

#define SYSCON_CAN_20MHZ_CLOCK_CTRL_FRO_CALIBRATION_EN_MASK (0xF0000U)
#define SYSCON_CAN_20MHZ_CLOCK_CTRL_FRO_CALIBRATION_EN_SHIFT (16U)
/*! FRO_CALIBRATION_EN - Enable FRO Calibration
 *  0b0101..Disable FRO Calibration, any other value also disable it.
 *  0b1010..Enable FRO Calibration
 */
#define SYSCON_CAN_20MHZ_CLOCK_CTRL_FRO_CALIBRATION_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_CAN_20MHZ_CLOCK_CTRL_FRO_CALIBRATION_EN_SHIFT)) & SYSCON_CAN_20MHZ_CLOCK_CTRL_FRO_CALIBRATION_EN_MASK)
/*! @} */

/*! @name SRAM0_ECC_CONTROL - SRAM0 ECC Function Control */
/*! @{ */

#define SYSCON_SRAM0_ECC_CONTROL_EERW_MASK       (0x1U)
#define SYSCON_SRAM0_ECC_CONTROL_EERW_SHIFT      (0U)
/*! EERW - Enable ECC write generation
 *  0b0..Disable ECC on reads
 *  0b1..Enable ECC on reads
 */
#define SYSCON_SRAM0_ECC_CONTROL_EERW(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_CONTROL_EERW_SHIFT)) & SYSCON_SRAM0_ECC_CONTROL_EERW_MASK)

#define SYSCON_SRAM0_ECC_CONTROL_EERC_MASK       (0x2U)
#define SYSCON_SRAM0_ECC_CONTROL_EERC_SHIFT      (1U)
/*! EERC - Enable ECC read check
 *  0b0..Disable ECC on writes
 *  0b1..Enable ECC on writes
 */
#define SYSCON_SRAM0_ECC_CONTROL_EERC(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_CONTROL_EERC_SHIFT)) & SYSCON_SRAM0_ECC_CONTROL_EERC_MASK)
/*! @} */

/*! @name SRAM0_ECC_REPORT - SRAM0 ECC Error Report Control */
/*! @{ */

#define SYSCON_SRAM0_ECC_REPORT_ENCR_MASK        (0x1U)
#define SYSCON_SRAM0_ECC_REPORT_ENCR_SHIFT       (0U)
/*! ENCR - Enable RAM ECC Non-correctable Reporting
 *  0b0..Non-correctable reporting and interrupt disabled
 *  0b1..Non-correctable reporting and interrupt enabled
 */
#define SYSCON_SRAM0_ECC_REPORT_ENCR(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_REPORT_ENCR_SHIFT)) & SYSCON_SRAM0_ECC_REPORT_ENCR_MASK)

