zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
#define SYSCON_SRAM0_ECC_REPORT_E1BR_MASK        (0x100U)
#define SYSCON_SRAM0_ECC_REPORT_E1BR_SHIFT       (8U)
/*! E1BR - Enable RAM ECC 1 Bit Reporting
 *  0b0..1-bit reporting disabled
 *  0b1..1-bit reporting enabled
 */
#define SYSCON_SRAM0_ECC_REPORT_E1BR(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_REPORT_E1BR_SHIFT)) & SYSCON_SRAM0_ECC_REPORT_E1BR_MASK)
/*! @} */

/*! @name SRAM0_ECC_EVENT_RECORD - SRAM0 ECC Error Event Record */
/*! @{ */

#define SYSCON_SRAM0_ECC_EVENT_RECORD_ENCERRN_MASK (0x4U)
#define SYSCON_SRAM0_ECC_EVENT_RECORD_ENCERRN_SHIFT (2U)
/*! ENCERRN - ECC Non-correctable Error */
#define SYSCON_SRAM0_ECC_EVENT_RECORD_ENCERRN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_EVENT_RECORD_ENCERRN_SHIFT)) & SYSCON_SRAM0_ECC_EVENT_RECORD_ENCERRN_MASK)

#define SYSCON_SRAM0_ECC_EVENT_RECORD_E1BERRN_MASK (0x400U)
#define SYSCON_SRAM0_ECC_EVENT_RECORD_E1BERRN_SHIFT (10U)
/*! E1BERRN - ECC 1-bit Error */
#define SYSCON_SRAM0_ECC_EVENT_RECORD_E1BERRN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_EVENT_RECORD_E1BERRN_SHIFT)) & SYSCON_SRAM0_ECC_EVENT_RECORD_E1BERRN_MASK)

#define SYSCON_SRAM0_ECC_EVENT_RECORD_EELOC_MASK (0xF000000U)
#define SYSCON_SRAM0_ECC_EVENT_RECORD_EELOC_SHIFT (24U)
/*! EELOC - ECC Error Location
 *  0b0010..non-correctable on SRAM0
 *  0b1010..1-bit correctable on SRAM0
 */
#define SYSCON_SRAM0_ECC_EVENT_RECORD_EELOC(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_EVENT_RECORD_EELOC_SHIFT)) & SYSCON_SRAM0_ECC_EVENT_RECORD_EELOC_MASK)

#define SYSCON_SRAM0_ECC_EVENT_RECORD_VALID_MASK (0x80000000U)
#define SYSCON_SRAM0_ECC_EVENT_RECORD_VALID_SHIFT (31U)
/*! VALID - Valid ECC Error Location field
 *  0b0..ECC Error Location field is not valid
 *  0b1..ECC Error Location field is valid
 */
#define SYSCON_SRAM0_ECC_EVENT_RECORD_VALID(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_EVENT_RECORD_VALID_SHIFT)) & SYSCON_SRAM0_ECC_EVENT_RECORD_VALID_MASK)
/*! @} */

/*! @name SRAM0_ECC_FAULT_ADDR - SRAM0 Fault Address Register */
/*! @{ */

#define SYSCON_SRAM0_ECC_FAULT_ADDR_EFADD_MASK   (0xFFFFFFFFU)
#define SYSCON_SRAM0_ECC_FAULT_ADDR_EFADD_SHIFT  (0U)
#define SYSCON_SRAM0_ECC_FAULT_ADDR_EFADD(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_ADDR_EFADD_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_ADDR_EFADD_MASK)
/*! @} */

/*! @name SRAM0_ECC_FAULT_ATTR - SRAM0 Fault Attribute Register */
/*! @{ */

#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFPRT_MASK   (0xFU)
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFPRT_SHIFT  (0U)
/*! EFPRT - RAM0 ECC Fault Protection */
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFPRT(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_ATTR_EFPRT_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_ATTR_EFPRT_MASK)

#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFMS_MASK    (0x70U)
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFMS_SHIFT   (4U)
/*! EFMS - RAM0 ECC Fault Master Size
 *  0b000..8-bit size
 *  0b001..16-bit size
 *  0b010..32-bit size
 *  0b011..64-bit size
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..Reserved
 */
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFMS(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_ATTR_EFMS_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_ATTR_EFMS_MASK)

#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFW_MASK     (0x80U)
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFW_SHIFT    (7U)
/*! EFW - RAM0 ECC Fault Write
 *  0b0..Last captured ECC event was not a write bus cycle
 *  0b1..Last captured ECC event was a write bus cycle
 */
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFW(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_ATTR_EFW_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_ATTR_EFW_MASK)

#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFMST_MASK   (0xFF00U)
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFMST_SHIFT  (8U)
/*! EFMST - RAM0 ECC Fault Master Number
 *  0b00000000..NBU Code
 *  0b00000001..NBU Data
 *  0b00000010..Radio
 *  0b00000011..DataStream
 *  0b00000100..CM33 Code
 *  0b00000101..CM33 Data
 *  0b00000110..ZEN-V Code
 *  0b00000111..ZEN-V Data
 *  0b00001000..DMA0
 *  0b00001001..TESTPORT
 *  0b00001010..PKC
 */
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFMST(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_ATTR_EFMST_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_ATTR_EFMST_MASK)

#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFSYN_MASK   (0x7F0000U)
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFSYN_SHIFT  (16U)
/*! EFSYN - RAM0 ECC Fault Syndrome */
#define SYSCON_SRAM0_ECC_FAULT_ATTR_EFSYN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_ATTR_EFSYN_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_ATTR_EFSYN_MASK)
/*! @} */

/*! @name SRAM0_ECC_FAULT_DATA - SRAM0 ECC Fault Data Low Register */
/*! @{ */

#define SYSCON_SRAM0_ECC_FAULT_DATA_EFDL_MASK    (0xFFFFFFFFU)
#define SYSCON_SRAM0_ECC_FAULT_DATA_EFDL_SHIFT   (0U)
/*! EFDL - SRAM0 ECC Fault Data Low */
#define SYSCON_SRAM0_ECC_FAULT_DATA_EFDL(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_SRAM0_ECC_FAULT_DATA_EFDL_SHIFT)) & SYSCON_SRAM0_ECC_FAULT_DATA_EFDL_MASK)
/*! @} */

/*! @name MATRIX_MODE_CTRL - Matrix Mode Control */
/*! @{ */

#define SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_RREN_MASK (0x1U)
#define SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_RREN_SHIFT (0U)
/*! INFRA_AXBS0_RREN - Infra AXBS0 Round Robin Enable
 *  0b0..AXBS0 in fixed priority arbitration mode at reset.
 *  0b1..AXBS0 in round robin arbitration mode at reset.
 */
#define SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_RREN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_RREN_SHIFT)) & SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_RREN_MASK)

#define SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_RREN_MASK (0x2U)
#define SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_RREN_SHIFT (1U)
/*! RADIO_AXBS0_RREN - Radio AXBS0 Round Robin Enable
 *  0b0..AXBS0 in fixed priority arbitration mode at reset.
 *  0b1..AXBS0 in round robin arbitration mode at reset.
 */
#define SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_RREN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_RREN_SHIFT)) & SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_RREN_MASK)

#define SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_RREN_MASK (0x4U)
#define SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_RREN_SHIFT (2U)
/*! MAIN_AXBS0_RREN - Main AXBS0 Round Robin Enable
 *  0b0..AXBS0 in fixed priority arbitration mode at reset.
 *  0b1..AXBS0 in round robin arbitration mode at reset.
 */
#define SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_RREN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_RREN_SHIFT)) & SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_RREN_MASK)

#define SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_AUTO_CG_EN_MASK (0x100U)
#define SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_AUTO_CG_EN_SHIFT (8U)
/*! INFRA_AXBS0_AUTO_CG_EN - Infra AXBS0 Auto Clock Gate Enable */
#define SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_AUTO_CG_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_AUTO_CG_EN_SHIFT)) & SYSCON_MATRIX_MODE_CTRL_INFRA_AXBS0_AUTO_CG_EN_MASK)

#define SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_AUTO_CG_EN_MASK (0x200U)
#define SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_AUTO_CG_EN_SHIFT (9U)
/*! MAIN_AXBS0_AUTO_CG_EN - Main AXBS0 Auto Clock Gate Enable */
#define SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_AUTO_CG_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_AUTO_CG_EN_SHIFT)) & SYSCON_MATRIX_MODE_CTRL_MAIN_AXBS0_AUTO_CG_EN_MASK)

#define SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_AUTO_CG_EN_MASK (0x400U)
#define SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_AUTO_CG_EN_SHIFT (10U)
/*! RADIO_AXBS0_AUTO_CG_EN - Radio AXBS0 Auto Clock Gate Enable */
#define SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_AUTO_CG_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_AUTO_CG_EN_SHIFT)) & SYSCON_MATRIX_MODE_CTRL_RADIO_AXBS0_AUTO_CG_EN_MASK)
/*! @} */

