zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
/*! @name FMC_CG_CTRL - Clock Gating Ctrl of Flash Memory Control */
/*! @{ */

#define SYSCON_FMC_CG_CTRL_FMC0_AUTO_CG_DIS_MASK (0x1U)
#define SYSCON_FMC_CG_CTRL_FMC0_AUTO_CG_DIS_SHIFT (0U)
/*! FMC0_AUTO_CG_DIS - Flash Memory Control 0 Auto Clock Gate Disable */
#define SYSCON_FMC_CG_CTRL_FMC0_AUTO_CG_DIS(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC_CG_CTRL_FMC0_AUTO_CG_DIS_SHIFT)) & SYSCON_FMC_CG_CTRL_FMC0_AUTO_CG_DIS_MASK)

#define SYSCON_FMC_CG_CTRL_FMC1_AUTO_CG_DIS_MASK (0x2U)
#define SYSCON_FMC_CG_CTRL_FMC1_AUTO_CG_DIS_SHIFT (1U)
/*! FMC1_AUTO_CG_DIS - Flash Memory Control 1 Auto Clock Gate Disable */
#define SYSCON_FMC_CG_CTRL_FMC1_AUTO_CG_DIS(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC_CG_CTRL_FMC1_AUTO_CG_DIS_SHIFT)) & SYSCON_FMC_CG_CTRL_FMC1_AUTO_CG_DIS_MASK)
/*! @} */

/*! @name FMC0_CTRL - Control for Flash Memory Controller 0 */
/*! @{ */

#define SYSCON_FMC0_CTRL_DNCBEI_MASK             (0x4U)
#define SYSCON_FMC0_CTRL_DNCBEI_SHIFT            (2U)
/*! DNCBEI - Disable non-correctable bus errors on flash instruction fetches
 *  0b0..Bus error for non-correctable error on instruction fetch from flash
 *  0b1..Disable bus error response for non-correctable error on instruction fetch from flash
 */
#define SYSCON_FMC0_CTRL_DNCBEI(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DNCBEI_SHIFT)) & SYSCON_FMC0_CTRL_DNCBEI_MASK)

#define SYSCON_FMC0_CTRL_DNCBED_MASK             (0x8U)
#define SYSCON_FMC0_CTRL_DNCBED_SHIFT            (3U)
/*! DNCBED - Disable non-correctable bus errors on flash data fetches
 *  0b0..Bus error for non-correctable error on data fetch from flash
 *  0b1..Disable bus error response for non-correctable error on data fetch from flash
 */
#define SYSCON_FMC0_CTRL_DNCBED(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DNCBED_SHIFT)) & SYSCON_FMC0_CTRL_DNCBED_MASK)

#define SYSCON_FMC0_CTRL_DDP_MASK                (0x10U)
#define SYSCON_FMC0_CTRL_DDP_SHIFT               (4U)
/*! DDP - Disable Data Prefetch
 *  0b0..Enable Data Prefetch
 *  0b1..Disable Data Prefetch
 */
#define SYSCON_FMC0_CTRL_DDP(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DDP_SHIFT)) & SYSCON_FMC0_CTRL_DDP_MASK)

#define SYSCON_FMC0_CTRL_DFS_MASK                (0x20U)
#define SYSCON_FMC0_CTRL_DFS_SHIFT               (5U)
/*! DFS - Disable Flash Speculate
 *  0b0..Enable Flash Speculate
 *  0b1..Disable Flash Speculate
 */
#define SYSCON_FMC0_CTRL_DFS(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DFS_SHIFT)) & SYSCON_FMC0_CTRL_DFS_MASK)

#define SYSCON_FMC0_CTRL_LKIFR1_MASK             (0x80U)
#define SYSCON_FMC0_CTRL_LKIFR1_SHIFT            (7U)
/*! LKIFR1 - Lock IFR1
 *  0b0..IFR1 space can be accessed.
 *  0b1..IFR1 space cannot be accessed. This bit is sticky. Once set, it is cleared with reset.
 */
#define SYSCON_FMC0_CTRL_LKIFR1(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_LKIFR1_SHIFT)) & SYSCON_FMC0_CTRL_LKIFR1_MASK)

#define SYSCON_FMC0_CTRL_ECFC_MASK               (0x100U)
#define SYSCON_FMC0_CTRL_ECFC_SHIFT              (8U)
/*! ECFC - Execute clear the flash cache
 *  0b0..do not clear the flash cache
 *  0b1..clear the flash cache (negate all valid bits in the cache)
 */
#define SYSCON_FMC0_CTRL_ECFC(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_ECFC_SHIFT)) & SYSCON_FMC0_CTRL_ECFC_MASK)

#define SYSCON_FMC0_CTRL_DFDC_MASK               (0x200U)
#define SYSCON_FMC0_CTRL_DFDC_SHIFT              (9U)
/*! DFDC - Disable flash data caching
 *  0b0..enable flash data caching
 *  0b1..disable flash data caching
 */
#define SYSCON_FMC0_CTRL_DFDC(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DFDC_SHIFT)) & SYSCON_FMC0_CTRL_DFDC_MASK)

#define SYSCON_FMC0_CTRL_DFIC_MASK               (0x400U)
#define SYSCON_FMC0_CTRL_DFIC_SHIFT              (10U)
/*! DFIC - Disable flash instruction caching
 *  0b0..enable flash instruction caching
 *  0b1..disable flash instruction caching
 */
#define SYSCON_FMC0_CTRL_DFIC(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DFIC_SHIFT)) & SYSCON_FMC0_CTRL_DFIC_MASK)

#define SYSCON_FMC0_CTRL_DFC_MASK                (0x800U)
#define SYSCON_FMC0_CTRL_DFC_SHIFT               (11U)
/*! DFC - Disable Flash Cache
 *  0b0..the flash cache is enable
 *  0b1..the flash cache is diabled
 */
#define SYSCON_FMC0_CTRL_DFC(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_DFC_SHIFT)) & SYSCON_FMC0_CTRL_DFC_MASK)

#define SYSCON_FMC0_CTRL_PFLEXSTALL_MASK         (0x10000U)
#define SYSCON_FMC0_CTRL_PFLEXSTALL_SHIFT        (16U)
/*! PFLEXSTALL - Flash Stall Enable
 *  0b0..Flash stall is disabled when flash is busy.
 *  0b1..Flash stall is enabled when flash is busy.
 */
#define SYSCON_FMC0_CTRL_PFLEXSTALL(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_PFLEXSTALL_SHIFT)) & SYSCON_FMC0_CTRL_PFLEXSTALL_MASK)

#define SYSCON_FMC0_CTRL_RO_MASK                 (0x80000000U)
#define SYSCON_FMC0_CTRL_RO_SHIFT                (31U)
/*! RO - Read-Only
 *  0b0..Writes to the FMC1_CTRL are allowed
 *  0b1..Writes to the FMC1_CTRL are ignored
 */
#define SYSCON_FMC0_CTRL_RO(x)                   (((uint32_t)(((uint32_t)(x)) << SYSCON_FMC0_CTRL_RO_SHIFT)) & SYSCON_FMC0_CTRL_RO_MASK)
/*! @} */

/*! @name CPU1_ACCESS_CTRL - CPU1 Access Control */
/*! @{ */

#define SYSCON_CPU1_ACCESS_CTRL_C1ME_MASK        (0x1U)
#define SYSCON_CPU1_ACCESS_CTRL_C1ME_SHIFT       (0U)
/*! C1ME - CPU1 Access Main Error
 *  0b0..Enable generating responce Error
 *  0b1..Disable generating responce Error, CPU1 will be stuck.
 */
#define SYSCON_CPU1_ACCESS_CTRL_C1ME(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_ACCESS_CTRL_C1ME_SHIFT)) & SYSCON_CPU1_ACCESS_CTRL_C1ME_MASK)

#define SYSCON_CPU1_ACCESS_CTRL_C1HB_MASK        (0x2U)
#define SYSCON_CPU1_ACCESS_CTRL_C1HB_SHIFT       (1U)
/*! C1HB - CPU1 BUS Halt Bypass Mode
 *  0b0..Disable bypass mechanism of CPU1 Sync-Bridge
 *  0b1..Enable bypass mechanism of CPU1 Sync-Bridge
 */
#define SYSCON_CPU1_ACCESS_CTRL_C1HB(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON_CPU1_ACCESS_CTRL_C1HB_SHIFT)) & SYSCON_CPU1_ACCESS_CTRL_C1HB_MASK)
/*! @} */

/*! @name GENERAL_REG_0 - General Register 0 */
/*! @{ */

#define SYSCON_GENERAL_REG_0_GENERAL_REG_MASK    (0xFFFFFFFFU)
#define SYSCON_GENERAL_REG_0_GENERAL_REG_SHIFT   (0U)
/*! GENERAL_REG - General Bit Field */
#define SYSCON_GENERAL_REG_0_GENERAL_REG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_GENERAL_REG_0_GENERAL_REG_SHIFT)) & SYSCON_GENERAL_REG_0_GENERAL_REG_MASK)
/*! @} */

/*! @name GENERAL_REG_1 - General Register 1 */
/*! @{ */

#define SYSCON_GENERAL_REG_1_GENERAL_REG_MASK    (0xFFFFFFFFU)
#define SYSCON_GENERAL_REG_1_GENERAL_REG_SHIFT   (0U)
/*! GENERAL_REG - General Bit Field */
#define SYSCON_GENERAL_REG_1_GENERAL_REG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_GENERAL_REG_1_GENERAL_REG_SHIFT)) & SYSCON_GENERAL_REG_1_GENERAL_REG_MASK)
/*! @} */

