zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SYSCON.h
/*! @name GENERAL_REG_2 - General Register 2 */
/*! @{ */

#define SYSCON_GENERAL_REG_2_GENERAL_REG_MASK    (0xFFFFFFFFU)
#define SYSCON_GENERAL_REG_2_GENERAL_REG_SHIFT   (0U)
/*! GENERAL_REG - General Bit Field */
#define SYSCON_GENERAL_REG_2_GENERAL_REG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_GENERAL_REG_2_GENERAL_REG_SHIFT)) & SYSCON_GENERAL_REG_2_GENERAL_REG_MASK)
/*! @} */

/*! @name GENERAL_REG_3 - General Register 3 */
/*! @{ */

#define SYSCON_GENERAL_REG_3_GENERAL_REG_MASK    (0xFFFFFFFFU)
#define SYSCON_GENERAL_REG_3_GENERAL_REG_SHIFT   (0U)
/*! GENERAL_REG - General Bit Field */
#define SYSCON_GENERAL_REG_3_GENERAL_REG(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON_GENERAL_REG_3_GENERAL_REG_SHIFT)) & SYSCON_GENERAL_REG_3_GENERAL_REG_MASK)
/*! @} */

/*! @name AUTHENTICATE - Protect SYSCON registers from unintentional writes */
/*! @{ */

#define SYSCON_AUTHENTICATE_DUMMY_LOCK_MASK      (0xFFFFFFFFU)
#define SYSCON_AUTHENTICATE_DUMMY_LOCK_SHIFT     (0U)
/*! DUMMY_LOCK - SYSCON Write Access Lock
 *  0b10101010101010101010101010101010..Unlock SYSCON registers write restriction, any other value will lock SYSCON registers
 */
#define SYSCON_AUTHENTICATE_DUMMY_LOCK(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_AUTHENTICATE_DUMMY_LOCK_SHIFT)) & SYSCON_AUTHENTICATE_DUMMY_LOCK_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SYSCON_Register_Masks */


/*!
 * @}
 */ /* end of group SYSCON_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SYSCON_H_ */

